openfoam/NASA_hump_data_coarse_3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          41;
        startFace       29929;
    }
    topWall
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          370;
        startFace       29970;
    }
    jet
    {
        type            patch;
        nFaces          20;
        startFace       30340;
    }
    outlet
    {
        type            patch;
        nFaces          41;
        startFace       30360;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          350;
        startFace       30401;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          30340;
        startFace       30751;
    }
)

// ************************************************************************* //
